class Sample0401 {
	public static void main(String[] args) {
		//クラスのブロック
		//4つのステイトメント
		System.out.println("こんにちは。みのるコーチです。"); //改行がある
		System.out.print("こんにちは。");//改行行わない←6行目と7行目が一行で表示される
		System.out.println("速水剛留です。");
		System.out.println("こんにちは。河合彩香です。");
		//ソースコードをわかりやすくするのは、3つ
		//①コメントを残す
		///**/まとめて、//一行のみ
		//②改行
		/*①ブロックの開始・終了
		　②ステートメントの終了
		　・その他、見やすさを考慮して過度に改行する
		*/
		/*③インデント
		・行の先頭に字下げ（インデント）を行う
		・基本的にはブロック毎に字下げ。
		・その他、見やすさを考慮する。
		・プロジェクトチームでは規則に従う・・tab・半角スペース2文字・4文字
		*/
	}
}
